Attribute VB_Name = "modProgressBar2"
'***************************************************************************************************
'   プログレスバー(frmProgressBar2)をコントロールする(共通変数)
'
'   作成者:井上治  URL:http://www.ne.jp/asahi/excel/inoue/ [Excelでお仕事!]
'***************************************************************************************************
'変更日付 Rev  変更履歴内容------------------------------------------------------------------------>
'03/08/19(1.00)新規作成
'19/12/29(1.11)処理記述整理(標準化準拠)
'***************************************************************************************************
Option Explicit
Option Private Module
'===================================================================================================
' クラス(clsProgressBar2)のインスタンス
Public g_objProgress2 As clsProgressBar2
' ProgressBarの表示有無スイッチ
Public g_blnShowProgressBar2 As Boolean

'----------------------------------------<< End of Source >>----------------------------------------
