Attribute VB_Name = "Module1"
'***************************************************************************************************
'   プログレスバーをコントロールするクラス(テスト用標準Module)      Module1(Module)
'
'   作成者:井上治  URL:http://www.ne.jp/asahi/excel/inoue/ [Excelでお仕事!]
'***************************************************************************************************
'変更日付 Rev  変更履歴内容------------------------------------------------------------------------>
'03/08/19(1.00)新規作成
'19/11/02(1.10)64ビット版Excelの対応(API関連)
'19/12/29(1.11)処理記述整理(標準化準拠)
'***************************************************************************************************
Option Explicit
Option Private Module
'===================================================================================================
Private Const g_cnsTitle As String = "プログレスバーのサンプル"
#If VBA7 Then
' ■スリープ(これは本サンプル用に必要なだけです)
Private Declare PtrSafe Sub Sleep Lib "KERNEL32.dll" _
    (ByVal dwMilliseconds As Long)
#Else
' ■スリープ(これは本サンプル用に必要なだけです)
Private Declare Sub Sleep Lib "KERNEL32.dll" _
    (ByVal dwMilliseconds As Long)
#End If

'***************************************************************************************************
'   ■■■ 公開プロシージャ ■■■
'***************************************************************************************************
'* 処理名　：SYORI_START
'* 機能　　：起動処理 ※本サンプルではこの処理がシートのボタンから起動されます。
'---------------------------------------------------------------------------------------------------
'* 返り値　：(なし)
'* 引数　　：(なし)
'---------------------------------------------------------------------------------------------------
'* 作成日　：2003年08月19日
'* 作成者　：井上　治
'* 更新日　：2019年12月29日
'* 更新者　：井上　治
'* 機能説明：
'* 注意事項：
'***************************************************************************************************
Public Sub MAIN_SYORI()
    '-----------------------------------------------------------------------------------------------
    Dim lngCNT_MAX As Long                                          ' 最大件数
    Dim lngCNT_NOW As Long                                          ' 現在件数
    ' クラス[clsProgressBar2]のインスタンスを生成
    Set g_objProgress2 = New clsProgressBar2
    '===============================================================================================
    '  ■初期処理
    '-----------------------------------------------------------------------------------------------
    ' プログレスバーのCaption(タイトル)の登録
    g_objProgress2.Caption = g_cnsTitle
    ' プログレスバーの閉じる[×]ボタンを表示するかのスイッチ設定
    ' ※記述しない場合は｢False(初期値)｣で動作します。
    g_objProgress2.ShowBox = False    ' Trueにすると表示されます。
    ' Escキーでの中断機能の使用有無のスイッチ設定
    ' ※記述しない場合は｢True(初期値)｣で動作します。
    g_objProgress2.EscStop = True     ' Falseにすると一切止まらなくなります。
    ' 最大件数のセット(普通は定数ではないですね)
    lngCNT_MAX = 1000
    ' Maxプロパティに最大件数をセット
    ' ※Showの後で変更しても構いません
    g_objProgress2.Max = lngCNT_MAX
    ' プログレスバーフォームを起動(Modeless)
    g_objProgress2.Show
    On Error GoTo ERR_STOP
    '===============================================================================================
    '  ■メイン処理
    '-----------------------------------------------------------------------------------------------
    ' 繰り返し(限度判定はこの方法とは限らない)
    Do While lngCNT_NOW <= lngCNT_MAX
        ' 中断判定
        If g_objProgress2.Tag = 9 Then Exit Do
        DoEvents
        ' 処理件数を加算
        lngCNT_NOW = lngCNT_NOW + 1
        ' 処理件数をValueプロパティにセット
        g_objProgress2.Value = lngCNT_NOW
        g_objProgress2.StatusBar = lngCNT_NOW & " / " & lngCNT_MAX
        '-----------------------------------------------------------------------
        ' ■■■ここで実際の1件分の処理を行なう■■■
        Sleep 10    ' これはサンプルなのでちょっと時間を消費
        '-----------------------------------------------------------------------
    Loop
    '===============================================================================================
    '  ■終了処理
    '-----------------------------------------------------------------------------------------------
    ' 終了(フォームを閉じる)
    g_objProgress2.Hide
    ' クラス[clsProgressBar2]のインスタンスを破棄
    Set g_objProgress2 = Nothing
    Exit Sub
    
'===================================================================================================
' 中断処理
ERR_STOP:
    ' ユーザー割り込みかを判定
    If Err.Number = 18 Then
        ' 終了しない場合は戻る(クラス側で確認処理)
        If g_objProgress2.EscKey() <> True Then Resume
    Else
        ' その他のエラーはメッセージ処置などを行なう
        MsgBox Err.Description, vbCritical, g_cnsTitle
    End If
    ' クラス[clsProgressBar2]のインスタンスを破棄
    Set g_objProgress2 = Nothing
End Sub

'----------------------------------------<< End of Source >>----------------------------------------
